src/cf/InformationRegisters/CRM_СтатусыПисемEmailРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_СтатусыПисемEmailРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыПисемEmailРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_РасшифровкиСтатусовПисемEmailРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_РасшифровкиСтатусовПисемEmailРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/CRM_ИнтеграцияСUniSenderСервер/Ext/Module.bsl
Функция ДанныеДоступаКUniSender() Экспорт
	ДанныеДоступа = Константы.CRM_ДанныеДоступаКUniSender.Получить().Получить();
	Если ДанныеДоступа = Неопределено Тогда
		ДанныеДоступа = Новый Структура("КлючДоступа, СписокДляРассылок, СписокДляОповещений", "", "", "");
	КонецЕсли;
	Возврат ДанныеДоступа;
КонецФункции

Процедура ЗаписатьДанныеДоступаКUniSender(КлючДоступа, СписокДляРассылок, СписокДляОповещений) Экспорт
	ДанныеДоступа = Новый Структура("КлючДоступа, СписокДляРассылок, СписокДляОповещений", КлючДоступа, СписокДляРассылок, СписокДляОповещений);
	Константы.CRM_ДанныеДоступаКUniSender.Установить(Новый ХранилищеЗначения(ДанныеДоступа));
КонецПроцедуры

Функция ПолучитьСтатусПисьма(Письмо) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СтатусыПисемEmailРассылки.Статус,
	                      |	CRM_СтатусыПисемEmailРассылки.СтатусСтрокой,
	                      |	CRM_РасшифровкиСтатусовПисемEmailРассылки.Расшифровка
	                      |ИЗ
	                      |	РегистрСведений.CRM_СтатусыПисемEmailРассылки КАК CRM_СтатусыПисемEmailРассылки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки КАК CRM_РасшифровкиСтатусовПисемEmailРассылки
	                      |		ПО CRM_СтатусыПисемEmailРассылки.СтатусСтрокой = CRM_РасшифровкиСтатусовПисемEmailРассылки.КодСтатуса
	                      |ГДЕ
	                      |	CRM_СтатусыПисемEmailРассылки.Письмо = &Письмо");
	Запрос.УстановитьПараметр("Письмо", Письмо);
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураСтатуса = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураСтатуса.Вставить("Статус", Выборка.Статус);
		СтруктураСтатуса.Вставить("СтатусСтрокой", Выборка.СтатусСтрокой);
		СтруктураСтатуса.Вставить("РасшифровкаСтатуса", Выборка.Расшифровка);
	Иначе
		СтруктураСтатуса.Вставить("Статус", Перечисления.CRM_СтатусыПисемEmailРассылки.ПустаяСсылка());
		СтруктураСтатуса.Вставить("СтатусСтрокой", "");
		СтруктураСтатуса.Вставить("РасшифровкаСтатуса", "");
	КонецЕсли;
	Возврат СтруктураСтатуса;
	
КонецФункции
